In [104]:
import pandas as pd
import numpy as np
import openpyxl;

In [105]:
customers = pd.read_csv("../data/customers.csv")
customers.head()

,Customer ID,Customer Name,Email,Member Since,Subscription Plan,Subscription Rate,Discount?,Cancellation Date
0,5001,Harmony Greene,Email: harmonious.vibes@email.com,3/13/23,Basic (Ads),$2.99,NaN,NaN
1,5002,Aria Keys,Email: melodious.aria@email.edu,3/13/23,NaN,$2.99,NaN,NaN
2,5004,Lyric Bell,Email: rhythmical.lyric@email.com,3/13/23,NaN,$2.99,NaN,6/1/23
3,5267,Rock Bassett,Email: groovy.rock@email.com,3/20/23,Basic (Ads),$2.99,NaN,NaN
4,5338,Rhythm Dixon,Email: beats.by.rhythm@email.edu,3/20/23,NaN,$2.99,NaN,NaN

In [106]:
listening_history = pd.read_excel('../data/listening_history.xlsx')
listening_history.head()

   Customer ID  Session ID  Audio Order  Audio ID Audio Type
0         5001      100520            1       101       Song
1         5001      100520            2       102       Song
2         5001      100520            3       103       Song
3         5001      100520            4       104       Song
4         5001      100520            5       105       Song

In [107]:
audio = pd.read_excel('../data/listening_history.xlsx', sheet_name=1)
audio.head()

         ID              Name      Genre  Popularity
0  Song-101   Dance All Night        Pop           1
1  Song-102  Unbreakable Beat        Pop           2
2  Song-103  Sunset Boulevard  Pop Music           5
3  Song-104    Glowing Hearts  Pop Music          10
4  Song-105         Pop Rocks  Pop Music          52

In [108]:
sessions = pd.read_excel('../data/listening_history.xlsx', sheet_name=2)
sessions.head()

   Session ID Session Log In Time
0      100520 2023-03-13 18:29:00
1      100522 2023-03-13 22:15:00
2      100525 2023-03-14 10:01:00
3      100527 2023-03-13 14:14:00
4      100538 2023-03-21 12:23:00

In [109]:
customers.dtypes

Customer ID           int64
Customer Name        object
Email                object
Member Since         object
Subscription Plan    object
Subscription Rate    object
Discount?            object
Cancellation Date    object
dtype: object

In [110]:
listening_history.dtypes

Customer ID     int64
Session ID      int64
Audio Order     int64
Audio ID        int64
Audio Type     object
dtype: object

In [111]:
audio.dtypes

ID            object
Name          object
Genre         object
Popularity     int64
dtype: object

In [112]:
sessions.dtypes

Session ID                      int64
Session Log In Time    datetime64[ns]
dtype: object

In [113]:
customers['Member Since'] = pd.to_datetime(customers['Member Since'], format='%m/%d/%y')
customers['Subscription Rate'] = pd.to_numeric(customers['Subscription Rate'].str.replace('$', ''))
customers['Cancellation Date'] = pd.to_datetime(customers['Cancellation Date'], format='%m/%d/%y')

In [114]:
customers.dtypes

Customer ID                   int64
Customer Name                object
Email                        object
Member Since         datetime64[ns]
Subscription Plan            object
Subscription Rate           float64
Discount?                    object
Cancellation Date    datetime64[ns]
dtype: object

In [115]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Customer ID        30 non-null     int64
 1   Customer Name      30 non-null     object
 2   Email              30 non-null     object
 3   Member Since       30 non-null     datetime64[ns]
 4   Subscription Plan  25 non-null     object
 5   Subscription Rate  30 non-null     float64
 6   Discount?          7 non-null      object
 7   Cancellation Date  13 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(1), int64(1), object(4)
memory usage: 2.0+ KB

In [116]:
listening_history.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 505 entries, 0 to 504
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Customer ID  505 non-null    int64
 1   Session ID   505 non-null    int64
 2   Audio Order  505 non-null    int64
 3   Audio ID     505 non-null    int64
 4   Audio Type   505 non-null    object
dtypes: int64(4), object(1)
memory usage: 19.9+ KB

In [117]:
audio.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          17 non-null     object
 1   Name        17 non-null     object
 2   Genre       17 non-null     object
 3   Popularity  17 non-null     int64
dtypes: int64(1), object(3)
memory usage: 676.0+ bytes

In [118]:
sessions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 90 entries, 0 to 89
Data columns (total 2 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Session ID           90 non-null     int64
 1   Session Log In Time  90 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(1)
memory usage: 1.5 KB

In [119]:
customers.head()

,Customer ID,Customer Name,Email,Member Since,Subscription Plan,Subscription Rate,Discount?,Cancellation Date
0,5001,Harmony Greene,Email: harmonious.vibes@email.com,2023-03-13,Basic (Ads),2.99,NaN,NaT
1,5002,Aria Keys,Email: melodious.aria@email.edu,2023-03-13,NaN,2.99,NaN,NaT
2,5004,Lyric Bell,Email: rhythmical.lyric@email.com,2023-03-13,NaN,2.99,NaN,2023-06-01
3,5267,Rock Bassett,Email: groovy.rock@email.com,2023-03-20,Basic (Ads),2.99,NaN,NaT
4,5338,Rhythm Dixon,Email: beats.by.rhythm@email.edu,2023-03-20,NaN,2.99,NaN,NaT

In [120]:
customers[customers['Subscription Plan'].isna()]

,Customer ID,Customer Name,Email,Member Since,Subscription Plan,Subscription Rate,Discount?,Cancellation Date
1,5002,Aria Keys,Email: melodious.aria@email.edu,2023-03-13,NaN,2.99,NaN,NaT
2,5004,Lyric Bell,Email: rhythmical.lyric@email.com,2023-03-13,NaN,2.99,NaN,2023-06-01
4,5338,Rhythm Dixon,Email: beats.by.rhythm@email.edu,2023-03-20,NaN,2.99,NaN,NaT
5,5404,Jazz Saxton,Email: jazzy.sax@email.com,2023-03-20,NaN,2.99,NaN,2023-06-03
11,5827,Rhythm Franklin,Email: rhythmic.franklin@email.edu,2023-03-28,NaN,2.99,NaN,NaT

In [121]:
customers[['Subscription Rate', 'Subscription Plan']].drop_duplicates()

    Subscription Rate Subscription Plan
0                2.99       Basic (Ads)
1                2.99               NaN
6                9.99  Premium (No Ads)
15              99.99  Premium (No Ads)
21               7.99  Premium (No Ads)

In [122]:
customers['Subscription Plan'] = customers['Subscription Plan'].fillna('Basic (Ads)')
customers.head()

,Customer ID,Customer Name,Email,Member Since,Subscription Plan,Subscription Rate,Discount?,Cancellation Date
0,5001,Harmony Greene,Email: harmonious.vibes@email.com,2023-03-13,Basic (Ads),2.99,NaN,NaT
1,5002,Aria Keys,Email: melodious.aria@email.edu,2023-03-13,Basic (Ads),2.99,NaN,NaT
2,5004,Lyric Bell,Email: rhythmical.lyric@email.com,2023-03-13,Basic (Ads),2.99,NaN,2023-06-01
3,5267,Rock Bassett,Email: groovy.rock@email.com,2023-03-20,Basic (Ads),2.99,NaN,NaT
4,5338,Rhythm Dixon,Email: beats.by.rhythm@email.edu,2023-03-20,Basic (Ads),2.99,NaN,NaT

In [123]:
customers[['Customer ID', 'Discount?']].tail()

    Customer ID Discount?
25         7224       Yes
26         7401       Yes
27         7579       NaN
28         7581       Yes
29         7583       Yes

In [124]:
customers['Discount?'].value_counts()

Discount?
Yes    7
Name: count, dtype: int64

In [125]:
customers['Discount?'] = np.where(customers['Discount?']=='Yes', 1, 0)
customers.head()

,Customer ID,Customer Name,Email,Member Since,Subscription Plan,Subscription Rate,Discount?,Cancellation Date
0,5001,Harmony Greene,Email: harmonious.vibes@email.com,2023-03-13,Basic (Ads),2.99,0,NaT
1,5002,Aria Keys,Email: melodious.aria@email.edu,2023-03-13,Basic (Ads),2.99,0,NaT
2,5004,Lyric Bell,Email: rhythmical.lyric@email.com,2023-03-13,Basic (Ads),2.99,0,2023-06-01
3,5267,Rock Bassett,Email: groovy.rock@email.com,2023-03-20,Basic (Ads),2.99,0,NaT
4,5338,Rhythm Dixon,Email: beats.by.rhythm@email.edu,2023-03-20,Basic (Ads),2.99,0,NaT

In [126]:
customers.describe()

,Customer ID,Member Since,Subscription Rate,Discount?,Cancellation Date
count,30.000000,30,30.000000,30.000000,13
mean,6276.333333,2023-04-10 06:24:00,8.556667,0.233333,2023-06-01 16:36:55.384615424
min,5001.000000,2023-03-13 00:00:00,2.990000,0.000000,2023-06-01 00:00:00
25%,5759.500000,2023-03-23 12:00:00,2.990000,0.000000,2023-06-01 00:00:00
50%,6196.000000,2023-04-05 12:00:00,2.990000,0.000000,2023-06-02 00:00:00
75%,6823.500000,2023-05-01 00:00:00,7.990000,0.000000,2023-06-02 00:00:00
max,7583.000000,2023-05-16 00:00:00,99.990000,1.000000,2023-06-03 00:00:00
std,814.255587,NaN,17.517840,0.430183,NaN

In [127]:
customers[customers['Subscription Rate'] > 7.99]

,Customer ID,Customer Name,Email,Member Since,Subscription Plan,Subscription Rate,Discount?,Cancellation Date
6,5581,Reed Sharp,Email: sharp.tunes@email.com,2023-03-21,Premium (No Ads),9.99,0,NaT
7,5759,Carol Kingbird,Email: songbird.carol@email.com,2023-03-22,Premium (No Ads),9.99,0,2023-06-02
8,5761,Sonata Nash,Email: musical.sonata@email.com,2023-03-28,Premium (No Ads),9.99,0,NaT
12,6029,Chord Campbell,Email: campbell.chordify@email.com,2023-03-29,Premium (No Ads),9.99,0,2023-06-02
14,6163,Melody Parks,Email: park.of.melodies@email.com,2023-04-05,Premium (No Ads),9.99,0,NaT
15,6229,Symphony Rhodes,Email: rhodes.symphony@email.com,2023-04-06,Premium (No Ads),99.99,0,2023-06-02

In [128]:
customers.iloc[15, 5] = 9.99

In [129]:
customers['Member Since'].max()

Timestamp('2023-05-16 00:00:00')

In [130]:
listening_history.describe()

       Customer ID     Session ID  Audio Order    Audio ID
count   505.000000     505.000000   505.000000  505.000000
mean   6112.247525  105225.554455     4.138614  112.063366
std     832.861221    3625.879577     2.669008   24.670285
min    5001.000000  100520.000000     1.000000  101.000000
25%    5267.000000  101925.000000     2.000000  103.000000
50%    6029.000000  105116.000000     4.000000  105.000000
75%    6822.000000  109654.000000     6.000000  109.000000
max    7583.000000  111333.000000    15.000000  205.000000

In [131]:
listening_history.head()

   Customer ID  Session ID  Audio Order  Audio ID Audio Type
0         5001      100520            1       101       Song
1         5001      100520            2       102       Song
2         5001      100520            3       103       Song
3         5001      100520            4       104       Song
4         5001      100520            5       105       Song

In [132]:
listening_history['Audio Type'].value_counts()

Audio Type
Song       463
Podcast     42
Name: count, dtype: int64

In [133]:
audio.head()

         ID              Name      Genre  Popularity
0  Song-101   Dance All Night        Pop           1
1  Song-102  Unbreakable Beat        Pop           2
2  Song-103  Sunset Boulevard  Pop Music           5
3  Song-104    Glowing Hearts  Pop Music          10
4  Song-105         Pop Rocks  Pop Music          52

In [134]:
audio['Genre'].value_counts()

Genre
Pop Music     3
Comedy        3
Hip Hop       3
Country       2
Pop           2
Jazz          2
True Crime    2
Name: count, dtype: int64

In [136]:
audio['Genre'] = np.where(audio['Genre'] == 'Pop Music', 'Pop', audio['Genre'])
audio['Genre'].value_counts()

Genre
Pop           5
Hip Hop       3
Comedy        3
Country       2
Jazz          2
True Crime    2
Name: count, dtype: int64

In [137]:
sessions['Session Log In Time'].max()

Timestamp('2023-05-31 06:03:00')

In [138]:
customers[customers.duplicated()]

Empty DataFrame
Columns: [Customer ID, Customer Name, Email, Member Since, Subscription Plan, Subscription Rate, Discount?, Cancellation Date]
Index: []

In [139]:
listening_history[listening_history.duplicated()]

Empty DataFrame
Columns: [Customer ID, Session ID, Audio Order, Audio ID, Audio Type]
Index: []

In [140]:
audio[audio.duplicated()]

Empty DataFrame
Columns: [ID, Name, Genre, Popularity]
Index: []

In [141]:
sessions[sessions.duplicated()]

Empty DataFrame
Columns: [Session ID, Session Log In Time]
Index: []

In [142]:
customers.describe()

,Customer ID,Member Since,Subscription Rate,Discount?,Cancellation Date
count,30.000000,30,30.000000,30.000000,13
mean,6276.333333,2023-04-10 06:24:00,5.556667,0.233333,2023-06-01 16:36:55.384615424
min,5001.000000,2023-03-13 00:00:00,2.990000,0.000000,2023-06-01 00:00:00
25%,5759.500000,2023-03-23 12:00:00,2.990000,0.000000,2023-06-01 00:00:00
50%,6196.000000,2023-04-05 12:00:00,2.990000,0.000000,2023-06-02 00:00:00
75%,6823.500000,2023-05-01 00:00:00,7.990000,0.000000,2023-06-02 00:00:00
max,7583.000000,2023-05-16 00:00:00,9.990000,1.000000,2023-06-03 00:00:00
std,814.255587,NaN,3.058998,0.430183,NaN

In [143]:
listening_history.describe()

       Customer ID     Session ID  Audio Order    Audio ID
count   505.000000     505.000000   505.000000  505.000000
mean   6112.247525  105225.554455     4.138614  112.063366
std     832.861221    3625.879577     2.669008   24.670285
min    5001.000000  100520.000000     1.000000  101.000000
25%    5267.000000  101925.000000     2.000000  103.000000
50%    6029.000000  105116.000000     4.000000  105.000000
75%    6822.000000  109654.000000     6.000000  109.000000
max    7583.000000  111333.000000    15.000000  205.000000

In [144]:
audio.describe()

       Popularity
count   17.000000
mean    21.058824
std     23.381271
min      1.000000
25%      4.000000
50%     10.000000
75%     28.000000
max     80.000000

In [145]:
sessions.describe()

          Session ID            Session Log In Time
count      90.000000                             90
mean   105619.788889  2023-04-27 08:18:34.000000512
min    100520.000000            2023-03-13 14:14:00
25%    102149.000000            2023-04-05 21:21:30
50%    105390.500000            2023-05-03 20:03:00
75%    109658.250000            2023-05-18 22:17:30
max    111333.000000            2023-05-31 06:03:00
std      3616.208569                            NaN

In [146]:
customers.head()

,Customer ID,Customer Name,Email,Member Since,Subscription Plan,Subscription Rate,Discount?,Cancellation Date
0,5001,Harmony Greene,Email: harmonious.vibes@email.com,2023-03-13,Basic (Ads),2.99,0,NaT
1,5002,Aria Keys,Email: melodious.aria@email.edu,2023-03-13,Basic (Ads),2.99,0,NaT
2,5004,Lyric Bell,Email: rhythmical.lyric@email.com,2023-03-13,Basic (Ads),2.99,0,2023-06-01
3,5267,Rock Bassett,Email: groovy.rock@email.com,2023-03-20,Basic (Ads),2.99,0,NaT
4,5338,Rhythm Dixon,Email: beats.by.rhythm@email.edu,2023-03-20,Basic (Ads),2.99,0,NaT

In [147]:
customers['Cancelled'] = np.where(customers['Cancellation Date'].notna(), 1, 0)
customers.head()

,Customer ID,Customer Name,Email,Member Since,Subscription Plan,Subscription Rate,Discount?,Cancellation Date,Cancelled
0,5001,Harmony Greene,Email: harmonious.vibes@email.com,2023-03-13,Basic (Ads),2.99,0,NaT,0
1,5002,Aria Keys,Email: melodious.aria@email.edu,2023-03-13,Basic (Ads),2.99,0,NaT,0
2,5004,Lyric Bell,Email: rhythmical.lyric@email.com,2023-03-13,Basic (Ads),2.99,0,2023-06-01,1
3,5267,Rock Bassett,Email: groovy.rock@email.com,2023-03-20,Basic (Ads),2.99,0,NaT,0
4,5338,Rhythm Dixon,Email: beats.by.rhythm@email.edu,2023-03-20,Basic (Ads),2.99,0,NaT,0

In [148]:
customers['Email'] = customers['Email'].str[6:]
customers.head()

,Customer ID,Customer Name,Email,Member Since,Subscription Plan,Subscription Rate,Discount?,Cancellation Date,Cancelled
0,5001,Harmony Greene,harmonious.vibes@email.com,2023-03-13,Basic (Ads),2.99,0,NaT,0
1,5002,Aria Keys,melodious.aria@email.edu,2023-03-13,Basic (Ads),2.99,0,NaT,0
2,5004,Lyric Bell,rhythmical.lyric@email.com,2023-03-13,Basic (Ads),2.99,0,2023-06-01,1
3,5267,Rock Bassett,groovy.rock@email.com,2023-03-20,Basic (Ads),2.99,0,NaT,0
4,5338,Rhythm Dixon,beats.by.rhythm@email.edu,2023-03-20,Basic (Ads),2.99,0,NaT,0